# Como aplicar funções em um pandas series, diferenças entre apply, map, e applymap.

In [1]:
# importando bibliotecas
import pandas as pd
import numpy as np

In [2]:
# https://bitly.com/
train = pd.read_csv('http://bit.ly/kaggletrain')

In [3]:
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
train['Sex_num'] = train['Sex'].map({'female':0 , 'male':1})

In [5]:
train.loc[0:4, ['Sex', 'Sex_num']]

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [6]:
# pegando valores da tabela ascci
print(ord("g"))
print(chr(103))

103
g

In [7]:
# apply aplica o resultado de uma função a serie de dados da coluna.
train['Name_length'] = train['Name'].apply(len)

In [8]:
train.loc[0:4, ['Name','Name_length']]

                                                Name  Name_length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [9]:
train['Fare_ceil'] = train.Fare.apply(np.ceil)

In [10]:
train.loc[0:4, ['Fare', 'Fare_ceil']]

      Fare  Fare_ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0

In [11]:
train['Name'].str.split(',').head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [12]:
def get_element(my_list, position):
    return my_list[position]

In [13]:
train['Name'].str.split(',').apply(get_element, position=0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [14]:
train['Name'].str.split(',').apply(get_element, position=1).head()

0                                Mr. Owen Harris
1     Mrs. John Bradley (Florence Briggs Thayer)
2                                    Miss. Laina
3             Mrs. Jacques Heath (Lily May Peel)
4                              Mr. William Henry
Name: Name, dtype: object

In [15]:

train['Name'].str.split(',').apply( lambda x : x[0] ).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [16]:
train['Name'].str.split(',').apply( [lambda x : x[0] ]).head()

    <lambda>
0     Braund
1    Cumings
2  Heikkinen
3   Futrelle
4      Allen

In [17]:
drinks = pd.read_csv('https://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [18]:
drinks.loc[: , 'beer_servings':'wine_servings']

     beer_servings  spirit_servings  wine_servings
0                0                0              0
1               89              132             54
2               25                0             14
3              245              138            312
4              217               57             45
..             ...              ...            ...
188            333              100              3
189            111                2              1
190              6                0              0
191             32               19              4
192             64               18              4

[193 rows x 3 columns]

# “axis 0” representa as linha e “axis 1” representa as colunas.

In [19]:
# Colunas axis=1
drinks.loc[: , 'beer_servings':'wine_servings'].apply(max, axis=1)

0        0
1      132
2       25
3      312
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Length: 193, dtype: int64

In [20]:
# Linhas axis=0
drinks.loc[: , 'beer_servings':'wine_servings'].apply(max, axis=0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [21]:
# Colunas axis=1
columns = drinks.loc[:, 'beer_servings':'wine_servings'].apply(np.argmax, axis=1)
columns.map({0:'beer_servings', 1:'spirit_servings', 2:'wine_servings'})

0        beer_servings
1      spirit_servings
2        beer_servings
3        wine_servings
4        beer_servings
            ...
188      beer_servings
189      beer_servings
190      beer_servings
191      beer_servings
192      beer_servings
Length: 193, dtype: object

In [22]:
# Colunas axis=1
drinks.loc[:, 'beer_servings':'wine_servings'].apply(np.argmax, axis=1).map({0:'beer_servings', 1:'spirit_servings', 2:'wine_servings'})

0        beer_servings
1      spirit_servings
2        beer_servings
3        wine_servings
4        beer_servings
            ...
188      beer_servings
189      beer_servings
190      beer_servings
191      beer_servings
192      beer_servings
Length: 193, dtype: object

In [23]:
drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float)

     beer_servings  spirit_servings  wine_servings
0              0.0              0.0            0.0
1             89.0            132.0           54.0
2             25.0              0.0           14.0
3            245.0            138.0          312.0
4            217.0             57.0           45.0
..             ...              ...            ...
188          333.0            100.0            3.0
189          111.0              2.0            1.0
190            6.0              0.0            0.0
191           32.0             19.0            4.0
192           64.0             18.0            4.0

[193 rows x 3 columns]

In [24]:
drinks.loc[:, 'beer_servings':'wine_servings'] = drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float)

In [25]:
drinks.head(4)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0.0,0.0,0.0,Asia
1,Albania,89.0,132.0,54.0,4.9,Europe
2,Algeria,25.0,0.0,14.0,0.7,Africa
3,Andorra,245.0,138.0,312.0,12.4,Europe

In [26]:
# Exemplo de series 
srs = pd.Series(['red', 'green', 'blue', 'white', 'black'])
print(srs[0])
print(srs[3])

red
white

In [27]:
# Exemplo de dataframe 
srs_a = pd.Series([10,30,60,80,90])
srs_b = pd.Series(['red', 'green', 'blue', 'white', 'black'])
df = pd.DataFrame({'a': srs_a, 'b':srs_b})
df

    a      b
0  10    red
1  30  green
2  60   blue
3  80  white
4  90  black

In [28]:
df.loc[2,'b']

'blue'

In [29]:
df.loc[2,'a']

60

In [30]:
srs = pd.Series([1, 3, np.nan, 4, np.nan])

In [31]:
srs

0    1.0
1    3.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [32]:
srs.dropna()

0    1.0
1    3.0
3    4.0
dtype: float64

In [33]:
srs.dropna(axis=0)

0    1.0
1    3.0
3    4.0
dtype: float64

In [34]:
srs_a = pd.Series([10,30,60,80,90])
srs_b = pd.Series([22, 44, 55, 77, 101])
df = pd.DataFrame({'a': srs_a, 'b': srs_b})
df

    a    b
0  10   22
1  30   44
2  60   55
3  80   77
4  90  101

In [35]:
df.sum(axis=0)
df.sum(axis='index')
df.sum(axis='rows')

a    270
b    299
dtype: int64

In [36]:
df.sum(axis=1)
df.sum(axis='columns')

0     32
1     74
2    115
3    157
4    191
dtype: int64

In [37]:
df1 = pd.DataFrame({'a': [1,3,6,8,9], 'b': ['red', 'green', 'blue', 'white', 'black']})
df2 = pd.DataFrame({'a': [0,2,4,5,7], 'b': ['jun', 'jul', 'aug', 'sep', 'oct']})

In [38]:
pd.concat([df1, df2], axis=0)

   a      b
0  1    red
1  3  green
2  6   blue
3  8  white
4  9  black
0  0    jun
1  2    jul
2  4    aug
3  5    sep
4  7    oct

In [39]:
pd.concat([df1, df2], axis=1)

   a      b  a    b
0  1    red  0  jun
1  3  green  2  jul
2  6   blue  4  aug
3  8  white  5  sep
4  9  black  7  oct

# Apply and lambda

In [34]:
import pandas as pd
import numpy as np
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])

df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [18]:
# Let's call this "custom_sum" as "sum" is a built-in function
def custom_sum(row):
    return row.sum()
df['D'] = df.apply(custom_sum, axis=1)
df

       A   B   C    D
Row 1  1  10  20   31
Row 2  2  20  40   62
Row 3  3  30  60   93
Row 4  4  40  80  124

In [19]:
df.loc['Row 5'] = df.apply(custom_sum, axis=0)
df

        A    B    C    D
Row 1   1   10   20   31
Row 2   2   20   40   62
Row 3   3   30   60   93
Row 4   4   40   80  124
Row 5  10  100  200  310

In [20]:
def multiply_by_2(val):
    return val * 2
df['E'] = df['C'].apply(multiply_by_2)
df

        A    B    C    D    E
Row 1   1   10   20   31   40
Row 2   2   20   40   62   80
Row 3   3   30   60   93  120
Row 4   4   40   80  124  160
Row 5  10  100  200  310  400

In [21]:
df['F'] = df.apply(lambda x:x.sum(), axis=1)
df

        A    B    C    D    E     F
Row 1   1   10   20   31   40   102
Row 2   2   20   40   62   80   204
Row 3   3   30   60   93  120   306
Row 4   4   40   80  124  160   408
Row 5  10  100  200  310  400  1020

In [22]:
df.loc['Row 5'] = df.apply(lambda x:x.sum(), axis=0)
df

        A    B    C    D    E     F
Row 1   1   10   20   31   40   102
Row 2   2   20   40   62   80   204
Row 3   3   30   60   93  120   306
Row 4   4   40   80  124  160   408
Row 5  20  200  400  620  800  2040

In [23]:
df['G'] = df['C'].apply(lambda x:x*2)
df

        A    B    C    D    E     F    G
Row 1   1   10   20   31   40   102   40
Row 2   2   20   40   62   80   204   80
Row 3   3   30   60   93  120   306  120
Row 4   4   40   80  124  160   408  160
Row 5  20  200  400  620  800  2040  800

In [25]:
_df_broadcast = df.apply(custom_sum, axis=1, result_type='broadcast')
_df_broadcast

          A     B     C     D     E     F     G
Row 1   244   244   244   244   244   244   244
Row 2   488   488   488   488   488   488   488
Row 3   732   732   732   732   732   732   732
Row 4   976   976   976   976   976   976   976
Row 5  4880  4880  4880  4880  4880  4880  4880

In [26]:
def cal_multi_col(row):
    return [row['A'] * 2, row['B'] * 3]

In [27]:
_df_expand = df.apply(cal_multi_col, axis=1, result_type='expand')
_df_expand

        0    1
Row 1   2   30
Row 2   4   60
Row 3   6   90
Row 4   8  120
Row 5  40  600

In [29]:
df[_df_expand.columns] = _df_expand
df

        A    B    C    D    E     F    G   0    1
Row 1   1   10   20   31   40   102   40   2   30
Row 2   2   20   40   62   80   204   80   4   60
Row 3   3   30   60   93  120   306  120   6   90
Row 4   4   40   80  124  160   408  160   8  120
Row 5  20  200  400  620  800  2040  800  40  600

In [30]:
df['New'] = df.apply(cal_multi_col, axis=1, result_type='reduce')
df

        A    B    C    D    E     F    G   0    1        New
Row 1   1   10   20   31   40   102   40   2   30    [2, 30]
Row 2   2   20   40   62   80   204   80   4   60    [4, 60]
Row 3   3   30   60   93  120   306  120   6   90    [6, 90]
Row 4   4   40   80  124  160   408  160   8  120   [8, 120]
Row 5  20  200  400  620  800  2040  800  40  600  [40, 600]

# Applymap()?

In [35]:
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])

df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [36]:
_df_square = df.applymap(np.square)
_df_square

        A     B     C
Row 1   1   100   400
Row 2   4   400  1600
Row 3   9   900  3600
Row 4  16  1600  6400

# Map()?

In [42]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [39]:
s.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [46]:
def func_frase(val):
    return f'I am a {val}'

In [47]:
s.map(func_frase)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [48]:
s.map('I am a {}'.format, na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object